7767517
221 258
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=32 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=3456
Swish                    silu_75                  1 1 1 2
Convolution              conv_1                   1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_76                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_2                   1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_77                  1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_3                   1 1 10 11 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_78                  1 1 11 12
Convolution              conv_4                   1 1 12 13 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_2              1 2 13 14 15
Sigmoid                  sigmoid_65               1 1 15 16
BinaryOp                 mul_0                    2 1 14 16 17 0=2
BinaryOp                 add_1                    2 1 9 17 18 0=0
Convolution              conv_5                   1 1 5 19 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_79                  1 1 19 20
Concat                   cat_0                    2 1 18 20 21 0=0
Convolution              conv_6                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_80                  1 1 22 23
Convolution              conv_7                   1 1 23 24 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_81                  1 1 24 25
Split                    splitncnn_3              1 2 25 26 27
Convolution              conv_8                   1 1 27 28 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_82                  1 1 28 29
Split                    splitncnn_4              1 2 29 30 31
Convolution              conv_9                   1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_83                  1 1 32 33
Convolution              conv_10                  1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_5              1 2 34 35 36
Sigmoid                  sigmoid_66               1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Split                    splitncnn_6              1 2 39 40 41
Convolution              conv_11                  1 1 41 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_84                  1 1 42 43
Convolution              conv_12                  1 1 43 44 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 44 45 46
Sigmoid                  sigmoid_67               1 1 46 47
BinaryOp                 mul_4                    2 1 45 47 48 0=2
BinaryOp                 add_5                    2 1 40 48 49 0=0
Convolution              conv_13                  1 1 26 50 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_85                  1 1 50 51
Concat                   cat_1                    2 1 49 51 52 0=0
Convolution              conv_14                  1 1 52 53 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_86                  1 1 53 54
Split                    splitncnn_8              1 2 54 55 56
Convolution              conv_15                  1 1 56 57 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_87                  1 1 57 58
Split                    splitncnn_9              1 2 58 59 60
Convolution              conv_16                  1 1 60 61 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_88                  1 1 61 62
Split                    splitncnn_10             1 2 62 63 64
Convolution              conv_17                  1 1 64 65 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_89                  1 1 65 66
Convolution              conv_18                  1 1 66 67 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_11             1 2 67 68 69
Sigmoid                  sigmoid_68               1 1 69 70
BinaryOp                 mul_6                    2 1 68 70 71 0=2
BinaryOp                 add_7                    2 1 63 71 72 0=0
Split                    splitncnn_12             1 2 72 73 74
Convolution              conv_19                  1 1 74 75 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_90                  1 1 75 76
Convolution              conv_20                  1 1 76 77 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 77 78 79
Sigmoid                  sigmoid_69               1 1 79 80
BinaryOp                 mul_8                    2 1 78 80 81 0=2
BinaryOp                 add_9                    2 1 73 81 82 0=0
Split                    splitncnn_14             1 2 82 83 84
Convolution              conv_21                  1 1 84 85 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_91                  1 1 85 86
Convolution              conv_22                  1 1 86 87 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 87 88 89
Sigmoid                  sigmoid_70               1 1 89 90
BinaryOp                 mul_10                   2 1 88 90 91 0=2
BinaryOp                 add_11                   2 1 83 91 92 0=0
Convolution              conv_23                  1 1 59 93 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_92                  1 1 93 94
Concat                   cat_2                    2 1 92 94 95 0=0
Convolution              conv_24                  1 1 95 96 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_93                  1 1 96 97
Split                    splitncnn_16             1 2 97 98 99
Convolution              conv_25                  1 1 99 100 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_94                  1 1 100 101
Split                    splitncnn_17             1 2 101 102 103
Convolution              conv_26                  1 1 103 104 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_95                  1 1 104 105
Split                    splitncnn_18             1 2 105 106 107
Convolution              conv_27                  1 1 107 108 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_96                  1 1 108 109
Convolution              conv_28                  1 1 109 110 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_19             1 2 110 111 112
Sigmoid                  sigmoid_71               1 1 112 113
BinaryOp                 mul_12                   2 1 111 113 114 0=2
BinaryOp                 add_13                   2 1 106 114 115 0=0
Convolution              conv_29                  1 1 102 116 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_97                  1 1 116 117
Concat                   cat_3                    2 1 115 117 118 0=0
Convolution              conv_30                  1 1 118 119 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_98                  1 1 119 120
Convolution              conv_31                  1 1 120 121 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_99                  1 1 121 122
Split                    splitncnn_20             1 2 122 123 124
Pooling                  maxpool2d_62             1 1 124 125 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_21             1 2 125 126 127
Pooling                  maxpool2d_63             1 1 127 128 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_22             1 2 128 129 130
Pooling                  maxpool2d_64             1 1 130 131 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 123 126 129 131 132 0=0
Convolution              conv_32                  1 1 132 133 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_100                 1 1 133 134
Convolution              conv_33                  1 1 134 135 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_101                 1 1 135 136
Split                    splitncnn_23             1 2 136 137 138
Interp                   interpolate_60           1 1 138 139 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 139 98 140 0=0
Split                    splitncnn_24             1 2 140 141 142
Convolution              conv_34                  1 1 142 143 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_102                 1 1 143 144
Convolution              conv_35                  1 1 144 145 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_103                 1 1 145 146
Convolution              conv_36                  1 1 146 147 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_104                 1 1 147 148
Convolution              conv_37                  1 1 141 149 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_105                 1 1 149 150
Concat                   cat_6                    2 1 148 150 151 0=0
Convolution              conv_38                  1 1 151 152 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_106                 1 1 152 153
Convolution              conv_39                  1 1 153 154 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_107                 1 1 154 155
Split                    splitncnn_25             1 2 155 156 157
Interp                   interpolate_61           1 1 157 158 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 158 55 159 0=0
Split                    splitncnn_26             1 2 159 160 161
Convolution              conv_40                  1 1 161 162 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_108                 1 1 162 163
Convolution              conv_41                  1 1 163 164 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_109                 1 1 164 165
Convolution              conv_42                  1 1 165 166 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 166 167
Convolution              conv_43                  1 1 160 168 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_111                 1 1 168 169
Concat                   cat_8                    2 1 167 169 170 0=0
Convolution              conv_44                  1 1 170 171 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_112                 1 1 171 172
Split                    splitncnn_27             1 2 172 173 174
Convolution              conv_45                  1 1 174 175 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_113                 1 1 175 176
Concat                   cat_9                    2 1 176 156 177 0=0
Split                    splitncnn_28             1 2 177 178 179
Convolution              conv_46                  1 1 179 180 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_114                 1 1 180 181
Convolution              conv_47                  1 1 181 182 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_115                 1 1 182 183
Convolution              conv_48                  1 1 183 184 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_116                 1 1 184 185
Convolution              conv_49                  1 1 178 186 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_117                 1 1 186 187
Concat                   cat_10                   2 1 185 187 188 0=0
Convolution              conv_50                  1 1 188 189 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_118                 1 1 189 190
Split                    splitncnn_29             1 2 190 191 192
Convolution              conv_51                  1 1 192 193 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_119                 1 1 193 194
Concat                   cat_11                   2 1 194 137 195 0=0
Split                    splitncnn_30             1 2 195 196 197
Convolution              conv_52                  1 1 197 198 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_120                 1 1 198 199
Convolution              conv_53                  1 1 199 200 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_121                 1 1 200 201
Convolution              conv_54                  1 1 201 202 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_122                 1 1 202 203
Convolution              conv_55                  1 1 196 204 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_123                 1 1 204 205
Concat                   cat_12                   2 1 203 205 206 0=0
Convolution              conv_56                  1 1 206 207 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_124                 1 1 207 208
Convolution              conv_57                  1 1 173 209 0=27 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Reshape                  reshape_128              1 1 209 210 0=40 1=40 11=9 2=3
Permute                  permute_125              1 1 210 211 0=3
Sigmoid                  sigmoid_72               1 1 211 212
Slice                    split_0                  1 3 212 213 214 215 -23300=3,2,2,5 1=3
MemoryData               /model.24/Constant_2_output_0 0 1 216 0=2 1=40 11=40 2=3
Eltwise                  weighted_sum_0           2 1 213 216 217 0=1 -23301=2,2.0,1.0
BinaryOp                 mul_16                   1 1 217 218 0=2 1=1 2=8.0
MemoryData               /model.24/Constant_6_output_0 0 1 219 0=2 1=40 11=40 2=3
BinaryOp                 mul_17                   1 1 214 220 0=2 1=1 2=2.0
UnaryOp                  pow_18                   1 1 220 221 0=4
BinaryOp                 mul_19                   2 1 221 219 222 0=2
Concat                   cat_13                   3 1 218 222 215 223 0=3
Reshape                  reshape_129              1 1 223 224 0=9 1=4800
Convolution              conv_58                  1 1 191 225 0=27 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
Reshape                  reshape_130              1 1 225 226 0=20 1=20 11=9 2=3
Permute                  permute_126              1 1 226 227 0=3
Sigmoid                  sigmoid_73               1 1 227 228
Slice                    split_1                  1 3 228 229 230 231 -23300=3,2,2,5 1=3
MemoryData               /model.24/Constant_10_output_0 0 1 232 0=2 1=20 11=20 2=3
Eltwise                  weighted_sum_1           2 1 229 232 233 0=1 -23301=2,2.0,1.0
BinaryOp                 mul_22                   1 1 233 234 0=2 1=1 2=16.0
MemoryData               /model.24/Constant_14_output_0 0 1 235 0=2 1=20 11=20 2=3
BinaryOp                 mul_23                   1 1 230 236 0=2 1=1 2=2.0
UnaryOp                  pow_24                   1 1 236 237 0=4
BinaryOp                 mul_25                   2 1 237 235 238 0=2
Concat                   cat_14                   3 1 234 238 231 239 0=3
Reshape                  reshape_131              1 1 239 240 0=9 1=1200
Convolution              conv_59                  1 1 208 241 0=27 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Reshape                  reshape_132              1 1 241 242 0=10 1=10 11=9 2=3
Permute                  permute_127              1 1 242 243 0=3
Sigmoid                  sigmoid_74               1 1 243 244
Slice                    split_2                  1 3 244 245 246 247 -23300=3,2,2,5 1=3
MemoryData               /model.24/Constant_18_output_0 0 1 248 0=2 1=10 11=10 2=3
Eltwise                  weighted_sum_2           2 1 245 248 249 0=1 -23301=2,2.0,1.0
BinaryOp                 mul_28                   1 1 249 250 0=2 1=1 2=32.0
MemoryData               /model.24/Constant_22_output_0 0 1 251 0=2 1=10 11=10 2=3
BinaryOp                 mul_29                   1 1 246 252 0=2 1=1 2=2.0
UnaryOp                  pow_30                   1 1 252 253 0=4
BinaryOp                 mul_31                   2 1 253 251 254 0=2
Concat                   cat_15                   3 1 250 254 247 255 0=3
Reshape                  reshape_133              1 1 255 256 0=9 1=300
Concat                   cat_16                   3 1 224 240 256 out0 0=0
